a = int(input("print length"))
b = int(input("print width"))

# Маша и Алиса учатся программировать. Алиса сообщила, что научилась рисовать прямоугольник с центром в начале координат, повернутый на любой угол. Маша сказала, что это очень интересно, но сможет ли Алиса посчитать точки с целочисленными координатами, которые попадают внутрь прямоугольника, повернутого на 45 градусов, включая те, что находятся на его границе?
# Помогите Алисе решить задачу.



# Входные данные:

# Стороны прямоугольника - целые числа <=10^9

# Выходные данные: 

# Количество точек, содержащихся внутри прямоугольника

# Максимальное время работы программы:

# 1 сек

# Решение, правильно работающее только для части случаев, получит оценку в соответствии с процентом верных ответов на тестовых данных

# Для примера:

# Входные данные	Результат
# 6
# 4
# 23
# 30
# 2
# 65
# 16
# 20
# 333
# 1
# 1
# 1
